#include "table.h"
#include "hash.h"
#include "sizeGenerator.h"

int main() {
	setlocale(LC_ALL, "rus");

	Table* table = new Table(Hash1, Fib);

	cout << "\n<=================[Добавление]=================>\n\n";

	string keys[] = 
		{
		"Иван",                                              //397516054
		"Никита",                                            //930231098
		"Галя",                                              //327786558
		"Катя",                                              //950377761
		"Игорь",                                             //816734272
		"Ибрагим",                                           //558525290
		"Святослав",                                         //336128328
		"Билли Херингтон",                                   //897645922
		"Владимир Красно Солнышко",                          //911390048
		"Джон Сноу",                                         //968283725
		"Быдло получает по заслугам нарезка справедливости", //163182420
		"Смешная нарезка детей",                             //454291136
		"Цыганские учёные уже много лет работают ",			 //797455468
		"над лекарством от рака, ",						     //518623975
		"но пока получается только героин",					 //859236546
		"Штирлиц долго смотрел в одну точку.",				 //372586435
		"Потом в другую.",									 //746141252
		"\"Двоеточие\", -смекнул Штирлиц",					 //40929397
		};

	for (int i = 0; i < sizeof(keys) / sizeof(keys[0]); i++) {
		table->Add(keys[i], i);
		//table->Show();
	}
	table->Show();

	cout << "\n<=================[Поиск]=================>\n\n";

	string key1 = "Катя";
	Element* temp = table->Find(key1);
	cout << "Find by key: " << key1 << " value: ";
	if (temp) cout << temp->Value << "\n";
	else cout << "-\n";

	cout << "\n<=================[Изменение]=================>\n\n";

	string key2 = "Игорь";
	t newValue = 100;
	cout << "Изменение значения по ключу: " << key2 << " Новое значение: " << newValue << '\n';
	bool res1 = table->ChangeValue(key2, newValue);
	table->Show();

	cout << "\n<=================[Удаление]=================>\n\n";

	bool res2 = table->Delete("Никита");
	bool res4 = table->Delete("Святослав");
	bool res3 = table->Delete("Билли Херингтон");
	table->Show();	
}
